Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.ObjectTypeEnum Enumeration
 The object type.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ObjectTypeEnum
Public Enumeration ObjectTypeEnum
Members
Member name | Value | Description
OBJECT_TYPE_MODEL | 1 |  The model object type.
OBJECT_TYPE_MEMBER | 2 |  The analytical member object type.
OBJECT_TYPE_NODE | 3 |  The node object type.
OBJECT_TYPE_PART | 4 |  The physical member object type.
OBJECT_TYPE_AREA | 5 |  The analytical area object type.
See Also
Reference
Tekla.Structures.Analysis Namespace